Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures.MergedPartHasDisConnectedGeometries Property
 A merged part geometry has dis-connected components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MergedPartHasDisConnectedGeometries { get; }
Public Shared ReadOnly Property MergedPartHasDisConnectedGeometries As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MergedPartHasDisConnectedGeometries {
	FailureDefinitionId^ get ();
}
static member MergedPartHasDisConnectedGeometries : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace